model_version: original_sleepdg
results_log_dir: /data/lijinyang/睡眠分期SSCF的test/人聚类人对齐结果Test/results/Ours-k5_2026-03-16_00-00-01
test_dataset: SHHS1
align:
  use_alignment: true
  cluster_centers_path: ./cluster/cluster_output_direct5/ours5_centers.npy
  cluster_map_path: ./cluster/cluster_output_direct5/ours5_map.json
seed: 42
gpus: '1'
datasets_dir: /fdata/lijinyang/datasets_dir2_all_Merged
batch_size: 256
num_workers: 8
cv_target_order:
- SHHS1
- P2018
- MROS1
- MROS2
- MESA
independent_test_datasets:
- ABC
- CCSHS
- CFS
- HMC
- ISRUC
- sleep-edfx
model:
  import_path: original.models.model
  class_name: Model
  ckpts:
  - /data/lijinyang/睡眠分期SSCF的test/人聚类人对齐结果Test/results/Ours-k5_2026-03-16_00-00-01/fold0/topk_ep004_va0.8456_ta0.8462.pth
  - /data/lijinyang/睡眠分期SSCF的test/人聚类人对齐结果Test/results/Ours-k5_2026-03-16_00-00-01/fold1/topk_ep004_va0.8460_ta0.8699.pth
  - /data/lijinyang/睡眠分期SSCF的test/人聚类人对齐结果Test/results/Ours-k5_2026-03-16_00-00-01/fold2/topk_ep005_va0.8576_ta0.7605.pth
  - /data/lijinyang/睡眠分期SSCF的test/人聚类人对齐结果Test/results/Ours-k5_2026-03-16_00-00-01/fold3/topk_ep004_va0.8588_ta0.8057.pth
  - /data/lijinyang/睡眠分期SSCF的test/人聚类人对齐结果Test/results/Ours-k5_2026-03-16_00-00-01/fold4/topk_ep014_va0.8688_ta0.7160.pth
  ensemble_method: logits
  strict_load: true
  use_dataparallel: false
model_type: LDP_CAA_Model
num_of_classes: 5
dropout: 0.1
projection_type: diag
lowrank_rank: 32
enable_stats_alignment: 1
anchor_momentum: 0.9
num_domains: 4
